Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: The C<L<use re 'E<sol>foo'|re/"'/flags' mode">> pragma can be used to set default modifiers (including these) for regular expressions compiled within its scope.
es: El pragma C<L<use re 'E<sol>foo'|re/"modo '/flags'">> se puede utilizar para establecer los modificadores predeterminados (estos también) para las expresiones regulares compiladas dentro de su ámbito.

source: The C<Moose> authors hope that one day C<Mouse> can be made obsolete by improving C<Moose> enough, but for now it provides a worthwhile alternative to C<Moose>.
es: Los autores de C<Moose> esperan que algún día, cuando C<Moose> haya mejorado lo suficiente, C<Mouse> pueda quedar obsoleto, pero de momento proporciona una sólida alternativa a C<Moose>.

source: The C<SUPER::> bit tells Perl to look for the C<print_info()> in the C class's inheritance chain.
es: C<SUPER::> le indica a Perl que busque el método C<imprimir_info()> en la cadena de herencia de la clase C.

source: The C<SUPER> modifier can I<only> be used for method calls.
es: El modificador C<SUPER> I<solo> se puede usar para llamar a métodos.

source: The C<SUPER> pseudo-class is resolved from the package where the call is made.
es: La seudoclase C<SUPER> se resuelve a partir del paquete en que se hace la llamada.

source: The C<UNIVERSAL> class will I<never> appear in a package's C<@ISA> variable.
es: La clase C<UNIVERSAL> I<nunca> aparecerá en la variable C<@ISA> de ningún paquete.

source: The C<VERSION> method returns the version number of the class (package).
es: El método C<VERSION> devuelve el número de versión de la clase (paquete).

source: The C<\A> and C<\Z> are just like "^" and "$", except that they won't match multiple times when the C</m> modifier is used, while "^" and "$" will match at every internal line boundary.
es: C<\A> y C<\Z> son como "^" y "$", pero no coincidirán múltiples veces cuando se usa el modificador C</m>, mientras que "^" y "$" coincidirán en cada límite de línea de la cadena.

source: The C<\G> assertion can be used to chain global matches (using C<m//g>), as described in L<perlop/"Regexp Quote-Like Operators">.
es: La aserción C<\G> se puede usar para encadenar coincidencias globales (obtenidas mediante C<m//g>), como se describe en L<perlop/"Operadores de entrecomillado para expresiones regulares">.

source: The C<\I<digit>> notation also works in certain circumstances outside the pattern.
es: En determinadas circunstancias, la notación C<\I<dígito>> también funciona fuera del patrón.

source: The C<\N> character class, not to be confused with the named character sequence C<\N{NAME}>, denotes any non-newline character in a regular expression.
es: La clase de caracteres C<\N>, que no debe confundirse con la secuencia de caracteres con nombre C<\N{NAME}>, se usa en expresiones regulares para denotar cualquier carácter que no sea de nueva línea.

source: The C<\g> and C<\k> notations were introduced in Perl 5.10.0.
es: Las notaciones C<\g> y C<\k> se introdujeron en Perl 5.10.0.

source: The C<antlers> import flag tells C<Class::Accessor> that you want to define your attributes using C<Moose>-like syntax.
es: La marca de importación C<antlers> indica a la clase C<Class::Accessor> que desea definir los atributos con el estilo de sintaxis de C<Moose>.

source: The C<bless> function can take either one or two arguments:
es: La función C<bless> permite usar uno o dos argumentos:

source: The C<bless> function then takes that reference and associates the hash with the class in C<$class>.
es: La función C<bless> recibe esa referencia y asocia el hash a la clase indicada por C<$clase>.

source: The C<can> method checks to see if the class or object it was called on has a method named C<$method>.
es: El método C<can> comprueba si la clase o el objeto usados disponen de un método llamado C<$metodo>.

source: The C<code> is evaluated at run time, at the moment this subexpression may match.
es: El C<código> se evalúa en tiempo de ejecución, en el momento en que esta subexpresión puede coincidir.

source: The C<code> is not interpolated.
es: El C<código> no se interpola.

source: The C<code> is properly scoped in the following sense: If the assertion is backtracked (compare L<"Backtracking">), all changes introduced after C<local>ization are undone, so that
es: El C<código> se circunscribe a un ámbito, en el sentido siguiente: si se vuelve atrás en la aserción (comparar con L<"Vuelta atrás">), se deshacen todos los cambios introducidos tras la C<local>ización, de forma que

source: The C<fetch> command just updates the C<camel> refs, as the objects themselves should have been fetched when pulling from C<origin>.
es: El comando C<fetch> solo actualiza las referencias de C<camel>, ya que se deben haber obtenido los objetos al traer cambios desde C<origin>.

source: The C<foreach> loop in Perl contains an iterator; so does a hash, allowing you to L<each|perlfunc/each> through it.
es: El bucle C<foreach> de Perl contiene un iterador; el hash también (es lo que permite usar la función L<each|perlfunc/each>).

source: The C<has()> subroutine declares an attribute, and C<Moose> automatically creates accessors for these attributes.
es: Los atributos se declaran con la subrutina C<has()> y C<Moose> crea automáticamente los métodos de acceso para los atributos declarados.

source: The C<if> and C<while> statements are defined in terms of L<BLOCKs|/BLOCK>, for instance.
es: Las instrucciones C<if> y C<while>, por ejemplo, también se definen en términos de L<BLOQUES|/BLOQUE>.

source: The C<isa> method returns I<true> if the object is a member of the class in C<$class>, or a member of a subclass of C<$class>.
es: El método C<isa> devuelve I<verdadero> si el objeto es un miembro de la clase especificada en C<$clase>, o bien de alguna de las subclases de C<$clase>.

source: The C<my> is actually not required; you could just use:
es: En realidad no es obligatorio usar C<my>; se puede usar simplemente:

source: The C<o?> matches at the beginning of C<'foo'>, and since the position in the string is not moved by the match, C<o?> would match again and again because of the C<*> quantifier.
es: C<o?> coincide con el inicio de C<'foo'>, y como la posición en la cadena no se ha movido por la coincidencia, C<o?> coincidirá una y otra vez a causa del cuantificador C<*>.

source: The C<resolve> function is called to generate a linearised ISA for the given stash, using this MRO.
es: La función C<resolve> se llama para generar una relación ISA lineal para el hash de tabla de símbolos (o "stash", contracción de I<symbol table hash>) indicado, con este orden de resolución de métodos.

source: The C<roffitall> utility is not installed on your system but lives in the F<pod/> directory of your Perl source kit; it converts all the documentation from the distribution to F<*roff> format, and produces a typeset PostScript or text file of the whole lot.
es: La utilidad C<roffitall> no se instala en el sistema, pero puede encontrarla en el directorio F<pod/> del kit de código fuente de Perl. Esta utilidad convierte toda la documentación de la distribución al formato F<*roff> y a partir de esto genera código fuente PostScript o un archivo de texto.

source: The C<s///> substitution operator is documented in L<perlop>.
es: El operador de sustitución, C<s///>, se describe en L<perlop>.

source: The C<use diagnostics> pragma automatically turns Perl's normally terse warnings and errors into these longer forms.
es: El pragma C<use diagnostics> convierte automáticamente las advertencias y errores de Perl, normalmente escuetos, en estos mensajes más desarrollados.

source: The C<use constant> pragma is a convenient shorthand for these.
es: El pragma C<use constant> es una abreviatura adecuada para estos casos.

source: The C<use sigtrap> and even C<use diagnostics> pragmas may also prove useful.
es: El pragma C<use sigtrap> y C<use diagnostics> pueden ser también muy útiles.

source: The C<use warnings> pragma (and the B<-w> switch) produces some lovely diagnostics.
es: El pragma C<use warnings> (y el modificador B<-w>) produce algunos diagnósticos muy interesantes.

source: The C<use> operator assumes this so you don't have to spell out "F<Module.pm>" in quotes.
es: El operador C<use> lo tiene en cuenta, para que no tenga que escribir "F<Modulo.pm>" entre comillas.

source: The CPAN is the Comprehensive Perl Archive Network and can be accessed at http://www.cpan.org/ , and searched at http://search.cpan.org/ .
es: CPAN es la abreviatura de I<Comprehensive Perl Archive Network>, una red de almacenamiento de recursos de Perl a la que se tiene acceso a través de L<http://www.cpan.org/> y en la que se pueden realizar búsquedas desde L<http://search.cpan.org/>.

source: The Camel book was originally written mostly over e-mail and today Perl's development is co-ordinated through mailing lists.
es: El libro del Camello original se escribió en su mayor parte a través de correo electrónico. Actualmente, el desarrollo de Perl se coordina mediante listas de correo.

source: The Comprehensive Perl Archive Network.
es: Comprehensive Perl Archive Network.

source: The F<Configure> script is ultimately responsible for generating a F<Makefile>.
es: El script F<Configure> se encarga de generar un archivo F<Makefile>.

source: The F<Cross> directory contains various files related to cross-compiling Perl.
es: El directorio F<Cross> contiene varios archivos relacionados con la compilación multiplataforma de Perl.

source: The F<MANIFEST> file in the root of the source tree contains a list of every file in the Perl core, as well as a brief description of each file.
es: El archivo F<MANIFEST> del directorio raíz del árbol de código fuente contiene una lista de todos los archivos incluidos en el núcleo de Perl, así como una breve descripción de cada archivo.

source: The F<Porting> directory contains a grab bag of code and documentation intended to help porters work on Perl.
es: El directorio F<Porting> contiene un conjunto de fragmentos de código y documentación que pueden servir de ayuda a los mantenedores de Perl.

source: The F<module-starter> utility is distributed as part of the L<Module::Starter|Module::Starter> CPAN package.
es: La utilidad F<module-starter> se distribuye como parte del paquete de CPAN L<Module::Starter|Module::Starter>.

source: The F<perldoc> program gives you access to all the documentation that comes with Perl.
es: El programa F<perldoc> proporciona acceso a toda la documentación incluida en Perl.

source: The F<perlivp> program is set up at Perl source code build time to test the Perl version it was built under.
es: El programa F<perlivp> se configura en tiempo de compilación del código fuente de Perl para comprobar la versión de Perl con la que se generó.

source: The F<pod.idx> file should contain fully qualified filenames, one per line.
es: El archivo F<pod.idx> debe contener nombres de archivo completos (uno por línea).

source: The I<Perl-Zeitung> is another German-speaking magazine for Perl beginners (see L<http://perl-zeitung.at.tf> ).
es: I<Perl-Zeitung> es otra revista en alemán para programadores Perl principiantes (visite L<http://perl-zeitung.at.tf> ).

source: The I<perl> program is not a compiler by this definition, but it does contain a kind of compiler that takes a program and turns it into a more executable form (L<syntax trees|/syntax tree>) within the I<perl> process itself, which the L</interpreter> then interprets.
es: Según esta definición, el intérprete I<perl> no es un compilador, pero contiene una especie de compilador que procesa un programa para convertirlo a un formato más fácil de ejecutar (L<árboles de sintaxis|/árbol de sintaxis>) dentro del mismo proceso de I<perl> para que el L</intérprete> lo interprete a continuación.

source: The I<perl> interpreter has to be compiled differently for each platform because it is implemented in C, but programs written in the Perl language are largely platform-independent.
es: El intérprete I<perl> debe compilarse de distinta manera para cada plataforma, ya que está implementado en C, pero los programas escritos en el lenguaje Perl son en gran medida independientes de la plataforma.

source: The L</AV> type is a subclass of L</SV>.
es: El tipo L</AV> es una subclase de L</SV>.

source: The L</CV> type is a subclass of L</SV>.
es: El tipo L</CV> es una subclase de L</SV>.

source: The L</GV> type is a subclass of L</SV>.
es: El tipo L</GV> es una subclase de L</SV>.

source: The L</HV> type is a subclass of L</SV>.
es: El tipo L</HV> es una subclase de L</SV>.

source: The L</file> (or L</string>, in the case of L<eval|perlfunc/eval>) that is currently being compiled.
es: El L</archivo> (o L</cadena>, en el caso de L<eval|perlfunc/eval>) que se está compilando actualmente.

source: The L</garbage collection> of globals (and the running of any associated object destructors) that takes place when a Perl L</interpreter> is being shut down.
es: La L</recolección de elementos no utilizados> de variables globales (y la ejecución de cualquier destructor de objetos asociado) que tiene lugar cuando se cierra un L</intérprete> de Perl.

source: The L</interpolation> of a scalar or array variable into a string.
es: La L</interpolación> de una variable escalar o de array en una cadena.

source: The L</package> in which the current statement is compiled.
es: El L</paquete> en el que se compila la instrucción actual.

source: The L</value> produced by a L</subroutine> or L</expression> when evaluated.
es: El L</valor> producido al evaluar una L</subrutina> o L</expresión>.

source: The L</value> returned to the parent L</process> when one of its child processes dies.
es: El L</valor> devuelto al L</proceso> primario cuando finaliza uno de sus procesos derivados.

source: The L<Carp|Carp> module allows you to present your error messages from the caller's perspective; this gives you a way to signal a problem with the caller and not your module.
es: El módulo L<Carp|Carp> permite presentar los mensajes de error desde la perspectiva del código que llama; esto permite indicar que el problema está en el código que hace la llamada y no en su módulo.

source: The L<Object::InsideOut> module on CPAN provides a comprehensive implementation of this technique, and you may see it or other inside-out modules in the wild.
es: El módulo L<Object::InsideOut> de CPAN proporciona una implementación completa de esta técnica y puede que encuentre esta implementación u otras en código de otros programadores.

source: The L<Task::Kensho> module has a list of recommended modules which you should review as a good starting point.
es: El módulo L<Task::Kensho> incluye una lista de módulos recomendados que debe revisar; es un buen punto de partida.

source: The L<mro> pragma provides some functions for manipulating the method cache directly.
es: El pragma L<mro> proporciona algunas funciones para manipular directamente la memoria caché de métodos.

source: The L<ord|perlfunc/ord> function returns the code point of a character.
es: La función L<ord|perlfunc/ord> devuelve el código de carácter de un carácter.

source: The L<parent> module is one of several ways that Perl lets you define inheritance relationships.
es: El módulo L<parent> es una de las muchas formas disponibles en Perl para definir relaciones de herencia.

source: The L<scalar values|/scalar value> that you supply to a L</function> or L</subroutine> when you call it.
es: Los L<valores escalares|/valor escalar> que se suministran a una L</función> o L</subrutina> al llamarla.

source: The L<split|perlfunc/split> function works on separators.
es: La función L<split|perlfunc/split> usa estos separadores.

source: The L<values|/value> you supply along with a program name when you tell a L</shell> to execute a L</command>.
es: Los L<valores|/valor> que se suministran con un nombre de programa para indicar a la L</shell> que debe ejecutar un L</comando>.

source: The Perl 5 interpreter was a complete re-write of the previous perl sources.
es: El intérprete de Perl 5 fue una reescritura completa del código fuente de perl.

source: The Perl Foundation is an advocacy organization for the Perl language which maintains the web site L<http://www.perl.org/> as a general advocacy site for the Perl language.
es: The Perl Foundation es una organización que respalda al lenguaje Perl y mantiene el sitio web L<http://www.perl.org/> como recurso general de apoyo a Perl.

source: The Perl Review, L<http://www.theperlreview.com> maintains a website and Google calendar (L<http://www.theperlreview.com/community_calendar>) for tracking workshops, hackathons, Perl Mongers meetings, and other events.
es: The Perl Review (L<http://www.theperlreview.com>) mantiene un sitio web y un calendario de Google (L<http://www.theperlreview.com/community_calendar>) que permiten hacer un seguimiento de talleres, hackathons y reuniones de Perl Mongers, entre otros eventos.

source: The Perl build system starts with the F<Configure> script in the root directory.
es: El sistema de compilación de Perl empieza por el script F<Configure> del directorio raíz.

source: The Perl community has a rather large IRC presence.
es: La comunidad Perl tiene una presencia bastante importante en IRC.

source: The Perl community is as diverse as Perl, and there is a large amount of evidence that the Perl users apply TMTOWTDI to all endeavors, not just programming.
es: La comunidad Perl es tan diversa como el lenguaje Perl, y hay una gran cantidad de evidencia de que los usuarios de Perl aplican a todo lo que hacen la filosofía TMTOWTDI (I<se puede hacer de varias maneras>), no solo a la programación.

source: The Perl community is geared toward supporting the most recent releases, so you'll have an easier time finding help for those.
es: La comunidad Perl tiende a ofrecer soporte para las versiones más recientes, por lo que le costará menos encontrar ayuda para estas versiones.

source: The Perl core has an extensive test suite.
es: Existe un completo conjunto de pruebas del núcleo de Perl.

source: The Perl core uses a handful of keys in C<%^H> which do not follow this convention, because they predate it.
es: En el núcleo de Perl se usan unas cuantas claves de C<%^H> que no siguen esta convención, ya que se definieron antes de que esta se estableciera.

source: The Perl motto is "There's more than one way to do it." Divining how many more is left as an exercise to the reader.
es: El lema de Perl es "Se puede hacer de varias maneras". Dejamos como ejercicio para el lector averiguar de cuántas maneras se puede hacer :-).

source: The Perl source tree is big.
es: El árbol de código fuente de Perl es frondoso.

source: The Perl test suite may still report some errors on the Hurd.
es: El conjunto de pruebas de Perl podría detectar errores en Hurd.

source: The Perl warning "Wide character in ..." is caused by a character with an ordinal value greater than 255.
es: La advertencia de Perl "Wide character in ..." se debe a que un carácter tiene un valor ordinal mayor que 255.

source: The Portable Operating System Interface specification.
es: Especificación de la Portable Operating System Interface (Interfaz de sistema operativo portable).

source: The Ram is a cookbook with hundreds of examples of using Perl to accomplish specific tasks:
es: El "Libro del Carnero" es un recetario que incluye cientos de ejemplos del uso de Perl para realizar tareas específicas:

source: The SV L</struct> knows its own "referent type", and the code is smart enough (we hope) not to try to call a L</hash> function on a L</subroutine>.
es: La estructura de datos L</struct> de SV conoce su propio "tipo de referente" y el código es lo suficientemente inteligente (o eso esperamos) para no intentar llamar a una función de L</hash> en una L</subrutina>.

source: The UTF8 flag, also called SvUTF8, is an internal flag that indicates that the current internal representation is UTF-8.
es: La marca UTF8, conocida también como SvUTF8, es una marca interna que indica que la representación interna actual es UTF-8.

source: The Unicode Bug has become rather infamous, leading to yet another (printable) name for this modifier, "Dodgy".
es: El "Error de Unicode" se ha convertido en algo más bien infame, que conduce a otro nombre (imprimible) en inglés para este modificador: "Dodgy" (poco fiable).

source: The Unix program that displays online documentation (manual pages) for you.
es: Programa de Unix que muestra la documentación en pantalla (páginas de manual).

source: The above recipes describe the ordering of matches I<at a given position>.
es: Las recetas anteriores describen el orden de las coincidencias I<en una determinada posición>.

source: The act of calling up a deity, daemon, program, method, subroutine, or function to get it do what you think it's supposed to do.
es: El acto de llamar a una deidad o un demonio, programa, método, subrutina o función para que haga lo que se supone que debe hacer.

source: The act of emptying a L</buffer>, often before it's full.
es: El acto de volcar un L</búfer>, generalmente cuando se llena.

source: The actual limit can be seen in the error message generated by code such as this:
es: El límite real se puede ver en el mensaje de error generado por código como el siguiente:

source: The actual location where C<\G> will match can also be influenced by using C<pos()> as an lvalue: see L<perlfunc/pos>.
es: La ubicación real donde C<\G> coincidirá también puede modificarse mediante C<pos()> como un valor-izquierda (vea L<perlfunc/pos>).

source: The additional state of being I<matched with zero-length> is associated with the matched string, and is reset by each assignment to pos().
es: El estado adicional de I<encontrado con longitud cero> se asocia a la cadena coincidente y se restablece con cada asignación a pos().

source: The agent on whose behalf a L</method> is invoked.
es: El agente en cuyo nombre se invoca un L</método>.

source: The anger you feel when the computer is being lazy.
es: La rabia que se siente ante los ataques de pereza del equipo.

source: The area in which a particular invocation of a particular file or subroutine keeps some of its temporary values, including any lexically scoped variables.
es: Área en la que una invocación específica de un archivo o una subrutina concretos mantiene algunos de sus valores temporales, incluidas las variables de ámbito léxico.

source: The array indices start with 0.
es: Los índices de array empiezan por 0.

source: The arrow operator (C<< -> >>) tells Perl that we are calling a method.
es: El operador flecha (C<< -> >>) le indica a Perl que se está llamando a un método.

source: The art of defining something (at least partly) in terms of itself, which is a naughty no-no in dictionaries but often works out okay in computer programs if you're careful not to recurse forever, which is like an infinite loop with more spectacular failure modes.
es: El arte de definir algo (al menos parcialmente) en términos de sí mismo, algo que no está bien visto en los diccionarios pero que suele funcionar en programas informáticos si se procura evitar que el proceso continúe indefinidamente, lo que sería parecido a un bucle infinito pero con modos de error más espectaculares.

source: The assignment C<$a[5][5][5][5][5] = "quintet"> potentially creates five scalar storage locations, plus four references (in the first four scalar locations) pointing to four new anonymous arrays (to hold the last four scalar locations).
es: La asignación C<$a[5][5][5][5][5] = "quinteto"> crea potencialmente cinco ubicaciones de almacenamiento escalar, además de cuatro referencias (en las cuatro primeras ubicaciones de escalares) que apuntan a cuatro arrays anónimos nuevos (que contendrán las cuatro últimas ubicaciones escalares).
